# Pandas DataFrame Oluşturma

In [1]:
import numpy as np
import pandas as pd

**pd.DataFrame()**
- DataFrame oluşturabiliriz. 
- columns parametresi ile kolon isimlerini belirleyebiliriz. 
- index parametresi ile index isimlerini belirleyebiliriz.

In [2]:
l = [1,2,39,67,90]
pd.DataFrame(l, columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [3]:
m = np.arange(1,10).reshape((3,3))
pd.DataFrame(m, columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [4]:
df = pd.DataFrame(m, columns=["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [5]:
df.columns = ("deg1","deg2","deg3")
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [6]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [7]:
df.shape

(3, 3)

In [8]:
df.ndim

2

In [9]:
df.size

9

In [10]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [11]:
type(df.values)

numpy.ndarray

In [12]:
df.tail(1)

   deg1  deg2  deg3
2     7     8     9

In [13]:
a = np.array([1,2,3,4,5,6,7,8,9,10])
pd.DataFrame(a, columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2              3
3              4
4              5
5              6
6              7
7              8
8              9
9             10

# Eleman İşlemleri

In [14]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [15]:
sozluk = {"var1":s1, "var2":s2, "var3":s3}
sozluk

{'var1': array([3, 1, 7, 1, 2]),
 'var2': array([7, 2, 2, 6, 1]),
 'var3': array([8, 8, 6, 9, 4])}

In [16]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     3     7     8
1     1     2     8
2     7     2     6
3     1     6     9
4     2     1     4

In [17]:
df[0:1]

   var1  var2  var3
0     3     7     8

In [18]:
df.index = ["a","b","c","d","e"]

In [19]:
df

   var1  var2  var3
a     3     7     8
b     1     2     8
c     7     2     6
d     1     6     9
e     2     1     4

In [20]:
df[0:1]

   var1  var2  var3
a     3     7     8

In [21]:
df["c" : "e"]

   var1  var2  var3
c     7     2     6
d     1     6     9
e     2     1     4

- df.drop() ile kolon veya satır silme işlemi yapabiliriz.
- axis=1 ile kolon silme işlemi yapabiliriz.
- axis=0 ile satır silme işlemi yapabiliriz.

In [22]:
df.drop("a", axis=0)

   var1  var2  var3
b     1     2     8
c     7     2     6
d     1     6     9
e     2     1     4

In [23]:
df

   var1  var2  var3
a     3     7     8
b     1     2     8
c     7     2     6
d     1     6     9
e     2     1     4

inplace parametresi ile değişikliği kalıcı kaydetme işlemi yapabiliriz. Diğer durumlarda değişiklikler geçici olarak kaydedilir.

In [24]:
df.drop("a", axis=0, inplace=True)

In [25]:
df

   var1  var2  var3
b     1     2     8
c     7     2     6
d     1     6     9
e     2     1     4

In [26]:
"var1" in df

True

In [27]:
l = ["var1","var4","var2"]
for i in l:
    print(i in df)

True
False
True

In [28]:
df["var4"] = df["var1"] / df["var2"]
df

   var1  var2  var3      var4
b     1     2     8  0.500000
c     7     2     6  3.500000
d     1     6     9  0.166667
e     2     1     4  2.000000

In [29]:
df.drop("var4", axis=1, inplace=True)

In [30]:
df

   var1  var2  var3
b     1     2     8
c     7     2     6
d     1     6     9
e     2     1     4

In [31]:
l = ["var1","var2"]
df.drop(l, axis=1)

   var3
b     8
c     6
d     9
e     4